app/services/Create/Address.rb

INSERT INTO "addresses" ("country", "state", "city", "district", "street", "complement", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create(params)
      ::Address.find_or_create_by!(make_address(params[:address]))