app/services/Create/Customer.rb

INSERT INTO "customers" ("name", "email", "contact", "created_at", "updated_at", "external_code") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create(params)
      ::Customer.find_or_create_by!(make_customer(params[:customer]))