app/services/Create/Item.rb

INSERT INTO "items" ("external_code", "name", "price", "quantity", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create(params)
      params[:items].map do |item|
       ::Item.find_or_create_by!(make_items(item))