app/services/Create/Order.rb

      def make(params)
        address  = Create::Address.new.run(params)
        customer = Create::Customer.new.run(params)
        item     = Create::Item.new.run(params)
        payment  = Create::Payment.new.run(params)
        ::Order.find_or_create_by!(make_order(
                                      params, address,
                                      customer, item, payment
                                      )
                                    )
---
INSERT INTO "orders" ("external_code", "store_id", "sub_total", "delivery_fee", "total", "dt_order_create", "postal_code", "number", "total_shipping", "created_at", "updated_at", "address_id", "customers_id", "items_id", "payments_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT "orders".* FROM "orders" WHERE (================================) LIMIT $1  [["LIMIT", 1]]