app/services/Create/Payment.rb

INSERT INTO "payments" ("modality", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["modality", "CREDIT_CARD"], ["value", 55.04], ["created_at", "2021-05-16 21:52:38.683973"], ["updated_at", "2021-05-16 21:52:38.683973"]]
SELECT "payments".* FROM "payments" WHERE (====================) LIMIT $1  [["LIMIT", 1]]
---
    def create(params)
      params[:payments].map do |item|
        ::Payment.find_or_create_by!(make_payment(item))