app/controllers/api/v1/orders_controller.rb

  def create_order
    attributes = payload
    attributes[:items_attributes].map! { |hash| hash&.except!('sub_items') }

    @order = Order.create!(attributes)
---
INSERT INTO "orders" ("external_code", "store_id", "sub_total", "delivery_fee", "total", "country", "state", "city", "district", "street", "complement", "latitude", "longitude", "dt_order_create", "postal_code", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"